Revit 2027 API
ParameterTypeId.StructuralMaterialParam Property
 "Structural Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralMaterialParam { get; }
Public Shared ReadOnly Property StructuralMaterialParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralMaterialParam {
	ForgeTypeId^ get ();
}
static member StructuralMaterialParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace